window.Trainer = window.Trainer || {};

(function () {
  const payoutCatalog = {
    threeCard: {
      ante: [
        ['Стрит', 1], ['Три одинаковых', 3], ['Стрит-флеш', 4], ['Мини-рояль', 10]
      ],
      pairPlus: [
        ['Пара', 1], ['Флеш', 4], ['Стрит', 5], ['Три одинаковых', 30], ['Стрит-флеш', 40], ['Мини-рояль', 50]
      ],
      jp: [
        ['Флеш', 2], ['Стрит', 10], ['Три одинаковых', 25], ['Стрит-флеш', 50], ['Стрит-флеш ♠', 100], ['Мини-рояль', 250], ['Мини-рояль ♠', 'jackpotPercent']
      ]
    }
  };

  Trainer.payoutCatalog = payoutCatalog;
})();
